import asyncio

from aiogram import Bot, Dispatcher, F
from aiogram.filters import CommandStart
from aiogram.types import Message, CallbackQuery, FSInputFile
from aiogram.utils.keyboard import InlineKeyboardBuilder

from config import BOT_TOKEN
from database import (
    create_database,
    create_user,
    get_current_gift,
    set_current_gift
)


bot = Bot(token=BOT_TOKEN)
dp = Dispatcher()


# ==================================================
# ПОДАРКИ
# ==================================================

GIFTS = [

    {
        "number": 1,
        "title": "🐈 Китик",
        "text": """
🎁 #GIFT №1

Начнём с чего-то поменьше.

Недавно ты сказал, что игрушки на панели стоят только в машинах мечты.

Соуу.

Машину мечты я тебе пока не купила.
И прикольного котика на панель я тоже не нашла(

Но есть неплохая альтернатива)
"""
    },

    {
        "number": 2,
        "title": "🐰 Зайчик",
        "text": """
🎁 #GIFT №2

Идём по накатанной к чему-то похожему,
но немного другому.

Эта вещь одна из самых милых что я видела за свою жизнь

Так оно ещё и пищит.

Можешь убедиться в этом сам.
"""
    },

    {
        "number": 3,
        "title": "🧧 Китайская магия",
        "text": """
🎁 #GIFT №3

Я очень люблю всякие обрядные вещички из разных культур,
которые хранят в себе энергию.

Особенно я люблю культуру азии.

Тут ты найдёшь сразу две вещи,
одна из которых созданна и заряженна лично мной.

Похожую ты уже видел у меня и я подумала,
что тебе она тоже необходима,

ведь в мире так мало чудес,
но мы можем их создавать сами.

Смотри что там
и главное верь,
тогда всё сбудется)
"""
    },

    {
        "number": 4,
        "title": "🐷 Розовая свинка",
        "text": """
🎁 #GIFT №4

Как-то ты обмолвился,
что скучал по количеству розового
в своей жизни.

И это нужно исправлять,
ведь без яркости жизнь совсем скучная.

Я бы конечно хотела исправить это лично,
но нужно ещё немного подождать))

А пока я ведь не могу просто
оставить тебя на растерзание этому серому миру.

Поэтому дарю тебе маленькую частичку розового :)
"""
    },

    {
        "number": 5,
        "title": "🕯️ Свеча",
        "text": """
🎁 #GIFT №5

А теперь немного спокойствия.

После всех этих котиков,
зайчиков, китайской магии
и розового недоразумения.

тебе, возможно,
не помешает немного тишины.
"""
    },

    {
        "number": 6,
        "title": "🦐 Креветка-программист",
        "text": """
🎁 #GIFT №6

Вспомнила недавно,
что ты тоже программист
и я нашла наверное лучшее олицитворение
этой профессии в физической форме.

На самом деле эта вещь показалась
мне невероятно забавной
и мы долго обсуждали,
что эту штуку придумал гений.

Но чтобы тебе её увидеть во всей красе
придётся постараться.
"""
    },

    {
        "number": 7,
        "title": "🍫 Детство",
        "text": """
🎁 #GIFT №7

Всё что было выше это конечно хорошо,
но я не могу представить ни один подарок
без этой части.
"""
    },

    {
        "number": 8,
        "title": "📖 Наши воспоминания",
        "text": """
🎁 #GIFT №8

Всё что было до этого
скорее дополнение,
подарки для развлечения,

но последние это основная часть
которую я изначально хотела тебе подарить.

Идея именно этого подарка
изначально была другой,
но в процессе
из-за многих обстоятельств поменялась.

Но суть и глубна остались похожими.

Здесь то во что я вложила свои силы
и частичку своей души,
то над чем я сама рефлексировала
пока делала.

Это нельзя просто посмотреть мимолётом,
здесь собранно много всего сразу
во что я надеюсь я смогу тебя погрузить
и ты сам будешь непротив углубиться
в это со мной.

Надеюсь тебе это не доставит неудобств
и ты искренне посмотришь на это
и после поделишься своими эмоциями.
"""
    },

    {
        "number": 9,
        "title": "❤️ Браслет",
        "text": """
🎁 #GIFT №9

Ну что...

Вот мы и дошли до последнего подарка.

Хотя в моей голове это была
первая вещь которую я тебе должна была подарить,
а потом не смогла остановиться хпх.

Это небольшой подарок
с физической точки зрения.

Но как мне кажется он крутой.

Эта вещь сделанная наполовину моими руками.

Без моего вмешательства обычная безделушка,
но я сделала её лично под тебя.

И ни у кого в мире
теперь точно такого же быть не может,
потому что он индивидуальный
и расписанн был по твоей эстетике.

ヽ(*´＾｀)ﾉ❤️
"""
    }
]


# ==================================================
# КЛАВИАТУРЫ
# ==================================================

def start_keyboard():
    builder = InlineKeyboardBuilder()

    builder.button(
        text="🐈 Я готов",
        callback_data="start_quest"
    )

    return builder.as_markup()


def gift_keyboard(number):
    builder = InlineKeyboardBuilder()

    builder.button(
        text=f"🎁 Открыть подарок №{number}",
        callback_data=f"open_{number}"
    )

    return builder.as_markup()


def opened_keyboard(number):
    builder = InlineKeyboardBuilder()

    builder.button(
        text="❤️ Я открыл",
        callback_data=f"opened_{number}"
    )

    return builder.as_markup()


def listened_keyboard(number):
    builder = InlineKeyboardBuilder()

    builder.button(
        text="❤️ Я прослушал",
        callback_data=f"listened_{number}"
    )

    return builder.as_markup()


# ==================================================
# START
# ==================================================

@dp.message(CommandStart())
async def start(message: Message):

    user_id = message.from_user.id

    create_user(user_id)

    current_gift = get_current_gift(user_id)

    if current_gift > len(GIFTS):

        await message.answer(
            """
🎂 Ты уже прошёл весь квест!

Все подарки получены.

LEVEL 19 UNLOCKED ❤️
"""
        )

        return

    if current_gift == 1:

        text = """
(^з^)-☆ 19:13 // birthday protocol

Приветик, Пашка.

Или всё таки лучше:

Кис~

Воот и тебе исполнилось 19 годиков

И я решила, что просто прислать тебе коробочку
с подарками было бы слишком скучно.
Да и я бы хотела лично побыть с тобой во время распаковки,
И разделить эти эмоции.

Но жизнь не так легка.
Поэтому теперь у тебя есть виртуальный гид,
который будет тебя сопровождать во время распаковки)

Подарки пронумерованы.
И открывать их желательно по порядку.

Я сказала «желательно»,
но вообще-то — обязательно.

Потому что здесь я главная (*^^*)
"""

        await message.answer(
            text,
            reply_markup=start_keyboard()
        )

    else:

        await message.answer(
            f"""
С возвращением, Киса.

Ты остановился на подарке №{current_gift}.

Продолжаем?
""",
            reply_markup=gift_keyboard(current_gift)
        )


# ==================================================
# НАЧАЛО КВЕСТА
# ==================================================

@dp.callback_query(F.data == "start_quest")
async def start_quest(callback: CallbackQuery):

    user_id = callback.from_user.id

    create_user(user_id)

    set_current_gift(user_id, 1)

    await callback.message.edit_text(
        """
Личность подтверждена.

Birthday person: Pavel Goncharov
Age: 19
Gender: male
Orientation: ???
Code name: Kisa
Status: suspiciously adult.

Приступаем.
""",
        reply_markup=gift_keyboard(1)
    )

    await callback.answer()


# ==================================================
# ОТКРЫТИЕ ПОДАРКА
# ==================================================

@dp.callback_query(F.data.startswith("open_"))
async def open_gift(callback: CallbackQuery):

    user_id = callback.from_user.id

    create_user(user_id)

    number = int(callback.data.split("_")[1])

    current_gift = get_current_gift(user_id)

    if number != current_gift:

        await callback.answer(
            f"Сначала нужно открыть подарок №{current_gift} 😌",
            show_alert=True
        )

        return

    gift = GIFTS[number - 1]

    text = gift["text"]

    # Эта фраза только для первого подарка
    if number == 1:

        text += """
        
Когда действительно откроешь
нажми кнопку ниже.

Я слежу.
"""

    await callback.message.edit_text(
        text,
        reply_markup=opened_keyboard(number)
    )

    await callback.answer()


# ==================================================
# Я ОТКРЫЛ
# ==================================================

@dp.callback_query(F.data.startswith("opened_"))
async def gift_opened(callback: CallbackQuery):

    user_id = callback.from_user.id

    number = int(callback.data.split("_")[1])

    current_gift = get_current_gift(user_id)

    if number != current_gift:

        await callback.answer(
            "Кажется, мы немного заблудились 👀",
            show_alert=True
        )

        return


    # --------------------------------------------------
    # ПОДАРОК №1
    # --------------------------------------------------

    if number == 1:

        text = """
Ну вот и познакомились. 🐈

Он маленький, милый и тоже котик
пусть и не такой как должен был быть хпх

Но он случайно попался мне на глаза
и показался достойным твоего внимания.

А теперь — моё важное мнение.

🎙️ Послушай.
"""


    # --------------------------------------------------
    # ПОДАРОК №2
    # --------------------------------------------------

    elif number == 2:

        text = """
Ну что убедился, правда милашка?

Теперь именно он будет защищать тебя
от всех глупых людишек, пока меня нет рядом.

Пусть он и не выглядит устрашающе,

но как говорится: мал, да удал.

И вот мне снова есть, что рассказать.

🎙️ Послушай.
"""


    # --------------------------------------------------
    # ПОДАРОК №3
    # --------------------------------------------------

    elif number == 3:

        text = """
Сплетение двух культур китайской и японской

Первое, что ты видишь это "Китайский узел"

Символ благополучия, защиты и привлечения удачи.

Он не исполняет желания,
а скорее является оберегом и искусством.

Плетя узлы мы закладываем в него
нашу положительную энергию и мысли.

Это символ бесконечной гармонии,
который я сделала для тебя.

Его носят с собой на удачу
или вешают на видное место.

У меня такой уже есть)

И теперь у тебя тоже есть личный экземпляр,
сделанный специально для тебя.

Второя вещь — это "Омамори"

Японский амулет,
внутрь него помещают молитвы,
имена божеств
или собственные желания.

Последнее как раз наш случай.

Всё таки у тебя праздник
и никогда не помешает
лишний раз загадать желание.

А как это сделать объясню попозже.

Сначала...

🎙️ Послушай.
"""


    # --------------------------------------------------
    # ПОДАРОК №4
    # --------------------------------------------------

    elif number == 4:

        text = """
Воот такая вот милая маленькая частичка,
которая теперь надеюсь будет украшать твои будни
и немного напоминать обо мне.

Теперь у тебя появился тот кого можно всегда обнять.

Тот кто будет тебя безусловно любить,
всё таки в нём есть микро частичка меня.

А ещё он не спорит,
не обижается,
не расстраивается
и ему не нужно выяснять отношения.

Он просто всегда рядом
и всегда будет ждать тебя с теплом.

И вот интересный фанфакт
почему именно такая частичка розового

🎙️ Послушай.
"""


    # --------------------------------------------------
    # ПОДАРОК №5
    # --------------------------------------------------

    elif number == 5:

        text = """
Банально? Возможно.

Спросишь почему?
Честно сама незнаю.

Просто показалось, что это вайб.

Люди редко обращают внимания на мелкие детали,
которые создают уют.

Но чем больше такого в нашей жизни каждый день,
тем впринципе уютнее жить становится.

Казалось бы какой смысл от свечи,
да никакого.

Это просто атмосферно.

Это просто маленький комфорт.

Например во время работы тяжело сосредоточиться,
зажигаешь её и садишься работать.

Огонь успокаивает,
а рабочее место становится более уютным
за счёт тепла и запаха.

Иногда так не хватает чего-то простого..

Зажги её когда нужно долго работать
или когда будет меланхоличное настроение
или просто когда надоел весь мир
и хочется тишины...

🎙️ Послушай.
"""


    # --------------------------------------------------
    # ПОДАРОК №6
    # --------------------------------------------------

    elif number == 6:

        text = """
Да это мини-конструктор)

Придётся тебе
как-нибудь выделить на него время
и вспомнить детство.

Думаю ты быстро с ним управишься.

И надеюсь хорошо проведёшь время.

Поверь оно того стоит.

Если ещё не понял,
что должно получиться в итоге,
то в конце инструкции есть примерная картинка.

Думаю комментарии излишни, но..

🎙️ Послушай.
"""


    # --------------------------------------------------
    # ПОДАРОК №7
    # --------------------------------------------------

    elif number == 7:

        text = """
Надеюсь это всё ты ешь
и тебе будет вкусно.

Агуша тут если что,
как символ того,
чтобы вспомнить,
что мы все родом из детства.

И вообще у нас ещё молоко на губах не обсохло.

Это напоминание того,
что быть взрослым и серьёзным,
это конечно круто,

но не углубляйся в это сильно.

Не теряй себя в работе
и ответственности.

Всегда есть место тому,
чтобы побыть ребёнком
и если хочется отпустить себя
и подурачиться.

🎙️ Послушай.
"""


    # --------------------------------------------------
    # ПОДАРОК №8
    # --------------------------------------------------

    elif number == 8:

        text = """
Мини альбом,
в котором теперь хранятся
маленькие частички нашей жизни.

Я бы хотела сделать его намного больше
и уместить туда всё что было,

но боюсь одного альбома мне не хватит
и сил на это тоже.

Я правда незнаю насколько тебе это понравится.

Я сомневалась в этом каждый раз,
когда его делала.

Он не самый красивый и аккуратный,
слишком мало было у меня времени и сил.

Но у меня он всё равно вызвал очень много эмоций.

Возможно просто я излишне сентиментальная
и настолько сильно в это погрузилась.

Надеюсь я смогла вызвать у тебя
хотя бы немного приятных эмоций

или тебе было просто приятно
вспомнить прошлое
и посмотреть на фотокарточки.

🎙️ Послушай.
"""


    # --------------------------------------------------
    # ПОДАРОК №9
    # --------------------------------------------------

    else:

        text = """
Ну что, Кис...

Как тебе?

Даже незнаю, что сказать,
когда он теперь уже у тебя в руках.

А я даже не могу узнать
понравилось ли тебе,
понял ли ты что он хорошо тянется
или нужны ли дополнительные звенья.

(если что они там в комплекте тоже есть
и ты сможешь их поставить,
но должен подойти)

Просто я долго думала
понравится ли тебе что-то подобное,
впринципе.

Спрашивала у многих
как бы они отнеслись к такому подарку.

Но в итоге я просто поняла,
что я хочу подарить тебе эту эксклюзивную вещь,

именно с твоим вайбом
и просто стала делать.

Много я нервов с ним убила конечно хпх.

Но оно того определённо стоило.

Но я счастлива,
что всё таки тебе его подарила.

Надеюсь ты его захочешь носить хпх

🎙️ Послушай.
"""


    await callback.message.edit_text(
        text,
        reply_markup=listened_keyboard(number)
    )

    # Голосовое
    voice = FSInputFile(
        f"media/voice/gift{number}.ogg"
    )

    await callback.message.answer_voice(
        voice=voice
    )

    await callback.answer()


# ==================================================
# Я ПРОСЛУШАЛ
# ==================================================

@dp.callback_query(F.data.startswith("listened_"))
async def voice_listened(callback: CallbackQuery):

    user_id = callback.from_user.id

    number = int(callback.data.split("_")[1])

    current_gift = get_current_gift(user_id)

    if number != current_gift:

        await callback.answer(
            "Что-то пошло не по плану 😏",
            show_alert=True
        )

        return


    # Убираем кнопку "Я прослушал"
    await callback.message.edit_reply_markup(
        reply_markup=None
    )


    # --------------------------------------------------
    # ПОСЛЕ ПОДАРКА №3
    # --------------------------------------------------

    if number == 3:

        await callback.message.answer(
            """
🧧 ИНСТРУКЦИЯ ПО ЭКСПЛУАТАЦИИ ОМАМОРИ:

1. Загадать желание.

2. Написать его на маленькой бумажке.

3. Положить бумажку внутрь омамори.

4. Повесить его туда,
где он будет рядом
и иногда попадаться на глаза.

5. Больше не открывать его просто так.

6. Верить в своё желание
и периодически напоминать себе,
что ты вообще-то его загадал.

P.S.

Лично тот экземпляр,
который у тебя,
направлен на финансовое благополучие.

Но желание может быть любым,
а то, на что он направлен,
является основной его энергией как от амулета.

Если не сработает —
все претензии могу передать
в японское посольство хпх.
""",
        )

    # Переходим дальше
    set_current_gift(
        user_id,
        number + 1
    )

    # --------------------------------------------------
    # ЕСЛИ ЕСТЬ СЛЕДУЮЩИЙ ПОДАРОК
    # --------------------------------------------------

    if number < len(GIFTS):

        next_gift = GIFTS[number]

        await callback.message.answer(
            next_gift["text"],
            reply_markup=opened_keyboard(number + 1)
        )

    # --------------------------------------------------
    # ЕСЛИ ЭТО ПОСЛЕДНИЙ ПОДАРОК
    # --------------------------------------------------

    else:

        await callback.message.answer(
            """
🎂 Вот и всё.

Все подарки распакованы.

Но это ещё не значит,
что всё закончилось. ❤️
"""
        )

        await callback.message.answer(
            """
(*^o^)／＼(^-^*)

LEVEL 19 UNLOCKED

ОПЕРАЦИЯ «19:13» ЗАВЕРШЕНА.

Получено подарков: все

Пройдено уровней: 9/9

Степень взрослости:
не обнаружена.

❤️

Ещё раз с днём рождения, Кис ;)

Помни ты всегда достоин лучшего,
именно поэтому я здесь.
""",
        )

    await callback.answer("❤️")


# ==================================================
# ЗАПУСК
# ==================================================

async def main():

    create_database()

    print("Бот запущен!")

    await dp.start_polling(bot)


if __name__ == "__main__":
    asyncio.run(main())